---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.SteelElemPatternNumberY
source: html/0908e273-59e5-c296-9c4c-95decbfa514f.htm
---
# Autodesk.Revit.DB.ParameterTypeId.SteelElemPatternNumberY Property

"Number on side 2"

## Syntax (C#)
```csharp
public static ForgeTypeId SteelElemPatternNumberY { get; }
```